window.onload = function(){

//Форма з вибором улюбленого кольору:
//Створіть форму з декількома радіокнопками, кожна з яких представляє різний колір (наприклад, червоний, зелений, синій).
//Використовуйте подію onchange для кожної радіокнопки, щоб змінювати колір фону сторінки відповідно до вибору користувача.


//Форма для вибору хобі з чекбоксами:
//Створіть чекбокси для різних хобі (наприклад, читання, спорт, музика).
//Встановіть обробник події onchange для кожного чекбоксу, щоб відображати список вибраних хобі у текстовому елементі під формою.


//Форма з вибором країни із випадаючого списку:
//Створіть випадаючий список з назвами країн.
//Використовуйте подію onchange для випадаючого списку, щоб виводити інформацію про вибрану країну, таку як столиця або населення, в іншому елементі на сторінці.


//Форма для оцінювання якості обслуговування:

}