//Порівняння чисел: За допомогою prompt отримайте два числа від користувача. Використовуючи if, else if, і else, виведіть у консоль, яке з них більше, менше, або вони рівні. Пам'ятайте про різницю між == і ===.

let firstUserNumber = Number(prompt("Выберите первое число для сравнения"));
let secondUserNumber = Number(prompt("Выберите второе число для сравнения"));

if(firstUserNumber === secondUserNumber){
console.log("Числа одинаковые")
}
else if(firstUserNumber>secondUserNumber){
    console.log(`${secondUserNumber} это меньшее число`)
}
else{
    console.log(`${firstUserNumber} это меньшее число`)
}

//Перевірка парності: Запитайте у користувача число за допомогою prompt. Використовуючи оператор % та if-else, визначте, чи є число парним або непарним, і виведіть відповідне повідомлення у консоль.

let number = Number(prompt("Выберите парное или непарное число"));

if(number%2 === 0){
    console.log(`${number} это парное число`)
}
else{
    console.log(`${number} это непарное число`)
}


//Визначення року народження: Запитайте в користувача його вік за допомогою prompt. Використовуючи отримане значення та поточний рік (ви можете захардкодити поточний рік), виведіть у консоль рік народження користувача.

let thisYear = 2024;
let userYear = Number(prompt("Сколько Вам лет?"))
let dateofbirth = thisYear - userYear;
console.log(dateofbirth)

//Вгадай число: Запитайте у користувача число. Якщо введене число більше заданого вами (наприклад, 10), виведіть "Занадто велике". Якщо менше - "Занадто мале". Якщо користувач вгадав число, виведіть "Вітаємо, ви вгадали!".
 

let mynumber = Number(prompt("Выберите любое число"));

if(mynumber>5){
    console.log(`${mynumber} слишком большое`)
}
else if(mynumber<5){
    console.log(`${mynumber} слишком маленькое`)
}
else{
console.log(`Вы угадали число!`)
}
//Класифікація за оцінками: Запитайте у користувача його оцінку за 10-бальною шкалою за допомогою prompt. За допомогою if-else виведіть в консоль "Відмінно" (8-10), "Добре" (5-7), "Задовільно" (3-4), "Незадовільно" (менше 3).

let userMark =  Number(prompt("Какая Ваша оценка от 1 до 10?"));

if(userMark >= 8){
    console.log(`Отлично!`)
}
else if(userMark >= 5 && userMark <= 7){
    console.log(`Хорошо`)
}
else if(userMark >= 3 && userMark <= 4){
    console.log(`Удовлетварительно`)
}
else{
    console.log(`Неудовлетварительно`)
}

//Перевірка діапазону: Запитайте у користувача число. Якщо число знаходиться в діапазоні від 1 до 100 включно, виведіть "Число знаходиться в діапазоні". Якщо ні - "Число поза діапазоном".

let usernumber =  Number(prompt("Напишите любое число"));

if(usernumber >= 1 && usernumber <= 100){
    console.log(`${usernumber} находится в диапазоне`)
}
else{
    console.log(`${usernumber} не находится в диапазоне`)
}

//Перепишіть використовуючи тернарний оператор

let score = 75;
result = score > 50 ? console.log(`Прошёл`) : console.log(`Не прошёл`)

let temperature = 30;
tempResult = temperature > 25 ? console.log(`Горячо`) : console.log(`Прохладно`)

//Створіть програму для перевірки віку та країни проживання користувача з використанням prompt. Користувач має ввести свій вік та країну. Якщо вік більше 18 років і користувач з України, виведіть "Вітаємо, ви маєте право голосу в Україні". В іншому випадку, якщо вік більше 18, але країна не Україна, виведіть "Перевірте правила голосування у вашій країні". Якщо вік менше 18, виведіть "Ви ще занадто молоді для голосування".

let userAge = Number(prompt("Укажите свой возраст"));
let userCountry = (prompt("Укажите вашу страну"));

if(userAge >= 18 && userCountry == "Украина" || userCountry == "Україна" || userCountry == "Ukrain"){
    console.log(`Поздравляем, вы имеете право голосовать в Украине!`)
}
else if(userAge >= 18){
    console.log(`Проверьте правила голосования в вашей стране`)
}
else{
    console.log(`Вы ещё слишком молодой для голосования`)
}
