//Порівняння чисел: За допомогою prompt отримайте два числа від користувача. Використовуючи if, else if, і else, виведіть у консоль, яке з них більше, менше, або вони рівні. Пам'ятайте про різницю між == і ===.



//Перевірка парності: Запитайте у користувача число за допомогою prompt. Використовуючи оператор % та if-else, визначте, чи є число парним або непарним, і виведіть відповідне повідомлення у консоль.



//Визначення року народження: Запитайте в користувача його вік за допомогою prompt. Використовуючи отримане значення та поточний рік (ви можете захардкодити поточний рік), виведіть у консоль рік народження користувача.



//Вгадай число: Запитайте у користувача число. Якщо введене число більше заданого вами (наприклад, 10), виведіть "Занадто велике". Якщо менше - "Занадто мале". Якщо користувач вгадав число, виведіть "Вітаємо, ви вгадали!".



//Класифікація за оцінками: Запитайте у користувача його оцінку за 10-бальною шкалою за допомогою prompt. За допомогою if-else виведіть в консоль "Відмінно" (8-10), "Добре" (5-7), "Задовільно" (3-4), "Незадовільно" (менше 3).



//Перевірка діапазону: Запитайте у користувача число. Якщо число знаходиться в діапазоні від 1 до 100 включно, виведіть "Число знаходиться в діапазоні". Якщо ні - "Число поза діапазоном".



//Перепишіть використовуючи тернарний оператор
        


//Створіть програму для перевірки віку та країни проживання користувача з використанням prompt. Користувач має ввести свій вік та країну. Якщо вік більше 18 років і користувач з України, виведіть "Вітаємо, ви маєте право голосу в Україні". В іншому випадку, якщо вік більше 18, але країна не Україна, виведіть "Перевірте правила голосування у вашій країні". Якщо вік менше 18, виведіть "Ви ще занадто молоді для голосування".