//Створіть функцію wellcomUser, яка приймає масив і функцію-колбек hiUser яка виводить в console ('Вітаю ${user}'), і викликає цю функцію для кожного елемента масиву.

//Стрілкові функції. Перепишіть попередню функцію в стрілкову. Перепишіть стрілкову функцію в звичайну const multiplyValues = (a, b, c) => a * b * c;

//Створіть порожній масив та використайте метод push, щоб додати до нього кілька елементів (наприклад, чисел чи рядків).

//Створіть функцію, яка приймає масив і елемент, і використовує push для додавання цього елемента до масиву.

//Створіть масив і використайте метод pop, щоб видалити останній елемент з масиву.

// Напишіть функцію, яка приймає масив і використовує pop для видалення останнього елемента масиву.

//Створіть масив і використайте метод unshift, щоб додати елементи в початок масиву.

//Напишіть функцію, яка приймає масив і елемент, і використовує unshift для додавання цього елемента в початок масиву.

//Створіть масив і використайте метод shift, щоб видалити перший елемент з масиву.

//Напишіть функцію, яка приймає масив і використовує shift для видалення першого елемента масиву.

//творіть новий массив за допомогою методів розглянутих на уроці в якому видалені всі  значення "Remove"  з масиву  - ["Keep", "Remove", "Keep", "Remove", "Keep", "Keep", "Remove", "Remove"] в результаті повинен бути ось такий новий массив ["Keep", "Keep", "Keep", ...]

//Написати цикл який замінює відємне значення в масиві на 0  let checkArr = [69, 96, -66, 77, 85, -85, 14, -20, 90, -36] 

//Створити цикл який виводить значення в консоль в такому форматі "Сьогодні ....  у вас такі плани .." для данних використовує два массива let days = ["Понеділок", "Середа", "Неділя"] let plans = ["Урок 03", "Урок 04", "Вихідни"]